print(("ш"*10 + "\n")*10)
print("\x7d")
a = 1
print(a)
print("ghbdtn", "dff", "deff", "sdcd", '\n',"gdhdhd", "вровов")
a = "Аксинья", "Марфа", "Алена", "Максим"
print("Аксинья", "Марфа", "Алена", "Максим", sep= "@")
print("окно", "дерево", "квартира", "велосипед", sep=" ")

print("это здесь", "а это там", "мы приехали", "тормази", end="2@" + "\n")
print("это здесь", "а это там", "мы приехали", "тормази", sep="," + "\n")
print("вот это дыа", "Мы сделали это")

print("напечатй", "принтицо", "и", "будет", "яйцо", sep="#", end="@")

a = 8
old = 3
print(a)
print(old)
rezult = a + old

print(rezult)


a =6
b = 6
c = a + b
print(a)
print(c)