# Задание
# -------

# В программу вводят два целых числа W и X.

# W - это длина трубы.

# X - это длина поршня в трубе.

# Числа W и X таковы, что
# W >= 0,
# 0 <= X <= W

# Программа рисует при помощи символов
# трубу и поршень в ней.

# Как рисует? Вот примеры:


# 1. Например, W = 10, X = 3

# [===.......]

# (Между скобками [ и ] помещается
# W символов, причём первые X штук - это
# символы =, а остальные - точки.)


# 2. Например, W = 5, X = 0

# [.....]


# 3. Например, W = 17, X = 12

# [============.....]


# 4. Например, W = 5, X = 5

# [=====]


