export const articles = [
  {
    id: 123,
    title: "Что-то",
    description: "lote,vds asdvsd sdfsd sdfgsdfkl",
  },
  {
    id: 1,
    title: "Будущее фронтенд-разработки",
    description:
      "Узнайте, как новые инструменты сборки и современные фреймворки меняют подход к созданию интерфейсов в 2024 году.",
  },
  {
    id: 2,
    title: "Мастерство Pug и чистого кода",
    description:
      "Писать HTML вручную — это прошлый век. Разбираемся, как шаблонизаторы помогают сократить объем кода в два раза.",
  },
  {
    id: 3,
    title: "Секреты CSS-модулей",
    description:
      "Забудьте о конфликтах имен и глобальной области видимости. Изолируем стили компонентов правильно и эффективно.",
  },
  {
    id: 4,
    title: "Оптимизация производительности Vite",
    description:
      "Почему ваш проект на Vite работает быстро и как сделать его еще быстрее с помощью правильной настройки конфигурации.",
  },
  {
    id: 5,
    title: "Дизайн-системы в маленьких проектах",
    description:
      "Нужна ли вам полноценная дизайн-система, если вы делаете небольшой лендинг или личный блог?",
  },
  {
    id: 6,
    title: "Адаптивная верстка без боли",
    description:
      "Современные техники Grid и Flexbox позволяют создавать гибкие макеты, которые отлично смотрятся на любых устройствах.",
  },
];