import './App.css'

function App() {
  return (
    <div>
      <h1 style = {{color : 'red', fontSize : '20px', textAlign : 'center'}}>Буянов Алексей Николаеич</h1>
      <h2>веб-разработчик</h2>
      <p>Превращаю идеи в рабочие веб-решения. Разрабатываю адаптивные интерфейсы, оптимизирую производительность и строю надежную серверную логику. Люблю чистый код и продуманную архитектуру.</p>
      <br/>
      <p>💻 «Код — это не просто инструкция, это инструмент решения реальных задач.»</p>
    </div>
  )
}
export default App
